tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Java build tool
brew "ant"
# Armed Bear Common Lisp: a full implementation of Common Lisp
brew "abcl"
# Search tool like grep, but optimized for programmers
brew "ack"
# Spell checker with better logic than ispell
brew "aspell"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU database manager
brew "gdbm"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Garbage collector for C and C++
brew "bdw-gc"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Vector graphics library with cross-device output support
brew "cairo"
# Library for handling page faults in user mode
brew "libsigsegv"
# GNU CLISP, a Common Lisp implementation
brew "clisp"
# Dynamic, general-purpose programming language
brew "clojure"
# Common Lisp implementation with a long history
brew "clozure-cl"
# Convert to and from the X-Face format
brew "compface"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Version control system
brew "cvs"
# Command-line tool to interact with exercism.io
brew "exercism"
# Client for fetching mail from POP, IMAP, ETRN or ODMR-capable servers
brew "fetchmail"
# Infamous electronic fortune-cookie generator
brew "fortune"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GNU debugger
brew "gdb"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Generic library support script
brew "libtool"
# Common error values for all GnuPG components
brew "libgpg-error"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Command-driven, interactive function plotting
brew "gnuplot"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Common Lisp ANSI-standard Hyperspec
brew "hyperspec"
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# String tool
brew "intltool"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Build tool for Clojure
brew "leiningen"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# Text-based genealogy software
brew "lifelines"
# LZMA-based compression program similar to gzip or bzip2
brew "lzip"
# Text-to-HTML conversion tool
brew "markdown"
# MIT/GNU Scheme development tools and runtime library
brew "mit-scheme"
# Terminal based YouTube player and downloader
brew "mps-youtube"
# Single-player roguelike video game
brew "nethack"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# LGPL release of the Motif toolkit
brew "openmotif"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Extract just secret information out of OpenPGP secret keys
brew "paperkey"
# Highly capable, feature-rich programming language
brew "perl"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Paste PNG into files
brew "pngpaste"
# GNU Portable THreads
brew "pth"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Lisp installer and launcher for major environments
brew "roswell"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# Steel Bank Common Lisp system
brew "sbcl"
# Typography prettifier
brew "smartypants"
# User interface to the TELNET protocol
brew "telnet"
# Microsoft MS-TNEF attachment unpacker
brew "tnef"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# PDF viewer
brew "xpdf"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["without-imagemagick"]
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# VPN and encryption software
cask "encryptme"
# Double-entry accounting program
cask "gnucash"
# Web browser
cask "google-chrome"
# End-to-end encryption software
cask "keybase"
# Productivity tool
cask "launchbar"
# Office suite
cask "libreoffice"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Tool to manage the size and position of windows
cask "shiftit"
# Team communication and collaboration software
cask "slack"
# Open-source version of the X.Org X Window System
cask "xquartz"
