tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "snyk/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU database manager
brew "gdbm"
# Command-line interface for SQLite
brew "sqlite"
# Vector graphics library with cross-device output support
brew "cairo"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Java build tool
brew "ant"
# Spell checker with better logic than ispell
brew "aspell"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Garbage collector for C and C++
brew "bdw-gc"
# Dynamic, general-purpose programming language
brew "clojure"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Version control system
brew "cvs"
# Command-line tool to interact with exercism.io
brew "exercism"
# Client for fetching mail from POP, IMAP, ETRN or ODMR-capable servers
brew "fetchmail"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Infamous electronic fortune-cookie generator
brew "fortune"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# Generic library support script
brew "libtool"
# Common error values for all GnuPG components
brew "libgpg-error"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Cross-platform application and UI framework
brew "qt@5"
# Command-driven, interactive function plotting
brew "gnuplot"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# Improved top (interactive process viewer)
brew "htop"
# Common Lisp ANSI-standard Hyperspec
brew "hyperspec"
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# String tool
brew "intltool"
# Lightweight and flexible command-line JSON processor
brew "jq"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Build tool for Clojure
brew "leiningen"
# JIT library for the GNU compiler collection
brew "libgccjit"
# Library for handling page faults in user mode
brew "libsigsegv"
# C XSLT library for GNOME
brew "libxslt"
# Text-based genealogy software
brew "lifelines"
# Fast, async, resource-friendly link checker
brew "lychee"
# LZMA-based compression program similar to gzip or bzip2
brew "lzip"
# Utility for directing compilation
brew "make"
# Text-to-HTML conversion tool
brew "markdown"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Single-player roguelike video game
brew "nethack"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Extract just secret information out of OpenPGP secret keys
brew "paperkey"
# Highly capable, feature-rich programming language
brew "perl"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Paste PNG into files
brew "pngpaste"
# GNU Portable THreads
brew "pth"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Steel Bank Common Lisp system
brew "sbcl"
# Count lines of code in many languages
brew "sloccount"
# Typography prettifier
brew "smartypants"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Microsoft MS-TNEF attachment unpacker
brew "tnef"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Extraction utility for .zip compressed archives
brew "unzip"
# Vi 'workalike' with many additional features
brew "vim"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# PDF viewer
brew "xpdf"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# JavaScript package manager
brew "yarn"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Find & fix known vulnerabilities in open-source dependencies
brew "snyk/tap/snyk"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Multi-cloud backup application
cask "arq"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# VPN and encryption software
cask "encryptme"
cask "font-dejavu"
cask "font-noto-color-emoji"
# Free and open-source image editor
cask "gimp"
# Double-entry accounting program
cask "gnucash"
# Web browser
cask "google-chrome"
# Automated organization
cask "hazel"
# Secure video conferencing app
cask "jitsi-meet"
# Interface for reading and syncing eBooks
cask "kindle"
# Productivity tool
cask "launchbar"
# Office suite
cask "libreoffice"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Media player based on MPlayer and mplayer2
cask "mpv"
# Remote pair programming
cask "pop"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Team communication and collaboration software
cask "slack"
# Multimedia player
cask "vlc"
# Open-source version of the X.Org X Window System
cask "xquartz"
