a2ps
abcl
ack
archey
aspell
automake
aws-elasticbeanstalk
awscli
bash-completion
berkeley-db
clisp
clojure
clozure-cl
compface
coreutils
ctags
curl
cvs
dbus
dirmngr
elixir
d12frosted/emacs-plus/emacs-plus
exercism
fetchmail
fortune
fzf
gawk
gcc
gdb
ghostscript
git
git-extras
gmp@4
gnupg
gnuplot
gobject-introspection
gpg-agent
gtk+
heroku
htop
hub
hyperspec
imagemagick
intltool
jbig2dec
leiningen
lfe
libgsf
libusb-compat
libvo-aacenc
lifelines
lzip
mailutils
markdown
mercurial
mit-scheme
mps-youtube
namazu
nasm
nethack
netpbm
nvm
openmotif
ossp-uuid
p7zip
paperkey
pbzip2
pinentry-mac
pow
ppl
python@2
rebar
roswell
sbcl
smartypants
telnet
texi2html
tnef
tree
unixodbc
unrar
vim
w3m
wget
xpdf
