a2ps
abcl
ack
archey
aspell
atk
automake
aws-elasticbeanstalk
awscli
bash-completion
clisp
clojure
clozure-cl
compface
coreutils
ctags
curl
cvs
d12frosted/emacs-plus/emacs-plus
exercism
fetchmail
ffmpeg
fortune
gawk
gcc
gdb
git
gnu-sed
gnupg
gnuplot
htop
hub
hyperspec
imagemagick@6
intltool
leiningen
libcroco
lifelines
lzip
markdown
mit-scheme
mps-youtube
nasm
nethack
netpbm
node
nvm
openmotif
ossp-uuid
paperkey
pinentry-mac
pth
roswell
sbcl
smartypants
telnet
texi2html
texinfo
tnef
tree
uchardet
unrar
vim
w3m
wget
wxmac
xpdf
youtube-dl
zimg
