ack
adns
autoconf
automake
aws-elasticbeanstalk
awscli
bash-completion
bdw-gc
boost
cairo
clisp
cloog
compface
coreutils
ctags
dirmngr
docker
docker-compose
docker-machine
dos2unix
ecl
elixir
emacs-plus
erlang
exercism
fetchmail
flow
fontconfig
freetype
fribidi
gcc
gcc@4.9
gd
gdbm
gdk-pixbuf
gettext
ghostscript
git
glib
gmp
gmp@4
gnu-sed
gnupg
gnuplot
gnutls
go
gobject-introspection
gpg-agent
graphite2
gsasl
harfbuzz
heroku
hub
hyperspec
icu4c
ilmbase
imagemagick
imagemagick@6
isl
isl@0.11
isl@0.12
ispell
jasper
jbig2dec
jpeg
jq
ldns
leiningen
libassuan
libcerf
libcroco
libde265
libevent
libffi
libgcrypt
libgpg-error
libheif
libidn2
libksba
libmpc
libmpc@0.8
libomp
libpng
librsvg
libsigsegv
libtasn1
libtiff
libtool
libunistring
libusb
libusb-compat
libxml2
libyaml
little-cms2
lua
mailutils
markdown
mercurial
mix-completion
mogenerator
mongodb
mpfr
mpfr@2
mysql
ncurses
netpbm
nettle
node
npth
nvm
oniguruma
openexr
openjpeg
openssh
openssl
openssl@1.1
p11-kit
p7zip
pango
pcre
pcre2
perl
phantomjs
pinentry
pinentry-mac
pixman
pkg-config
postgresql
pth
python
python3
python@2
qt
rbenv
readline
redis
ruby
ruby-build
sbcl
shared-mime-info
slackcat
smartypants
sqlite
tidy-html5
tmux
tree
unbound
unrar
utf8proc
vault
vim
watchman
webp
wget
wxmac
x265
xz
yarn
