bartender
caffeine
chefdk
cloak
dash
dotnet-sdk
dropbox
emacs
gnucash
google-chrome
hazel
iterm2-beta
java
keybase
launchbar
libreoffice
mactex
postman
screenhero
shiftit
slack
virtualbox
visual-studio-code
